Revit 2027 API
ParameterTypeId.ViewPartsVisibility Property
 "Parts Visibility"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewPartsVisibility { get; }
Public Shared ReadOnly Property ViewPartsVisibility As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewPartsVisibility {
	ForgeTypeId^ get ();
}
static member ViewPartsVisibility : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace